# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Вывод сети и маски должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов (в двоичном формате
  надо добавить два пробела между столбцами
  для разделения октетов между собой)

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
ipmask = input("Введите адрес сети и маску: ")
ip = ipmask.split("/")[0].split(".")
mask = ipmask.split("/")[1]
mask_bin = "1" * int(mask) + "0" * (32-int(mask))
print("Network:\n", \
      format(ip[0], "8"), "  ", \
      format(ip[1], "8"), "  ", \
      format(ip[2], "8"), "  ", \
      format(ip[3], "8"), "  ", "\n", \
      format(int(bin(int(ip[0])).split("b")[1]), "08"), "  ", \
      format(int(bin(int(ip[1])).split("b")[1]), "08"), "  ", \
      format(int(bin(int(ip[2])).split("b")[1]), "08"), "  ", \
      format(int(bin(int(ip[3])).split("b")[1]), "08"), "  ", "\n" )
print("Mask:\n", "/"+mask, "\n", \
      format(int(mask_bin[0:8], 2), "<8"), "  ", \
      format(int(mask_bin[8:16], 2), "<8"), "  ", \
      format(int(mask_bin[16:24], 2), "<8"), "  ", \
      format(int(mask_bin[24:], 2), "<8"), "  ", "\n", \
      mask_bin[0:8], "  ", mask_bin[8:16], "  ", \
      mask_bin[16:24], "  ", mask_bin[24:], "  "
     )
